<a href="https://colab.research.google.com/github/lokeshneerasa/Pandas/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#---------------------------------> PANDAS <----------------------------------#
##------------> SERIES <---------##
#1.EMPTY SERIES OBJECT
import pandas as pd
a=pd.Series()
print(a)
print(type(a))

Series([], dtype: object)
<class 'pandas.core.series.Series'>

In [ ]:
#2.CREATING SERIES BY USING LIST
import pandas as pd
a=[85,93,52,66,30]
b=pd.Series(a)
print(b)

0    85
1    93
2    52
3    66
4    30
dtype: int64

In [ ]:
#CREATING SERIES BY USING LIST,ASSIGNING A NAME
import pandas as pd
a=[62,89,45,23,93]
b=pd.Series(a,name="Marks")
print(b)

0    62
1    89
2    45
3    23
4    93
Name: Marks, dtype: int64

In [ ]:
import pandas as pd
a=pd.Series([10,20,30,40,50])
print(a)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
import pandas as pd
a=pd.Series([10,20,30,40],name="RoLLNO")
print(a)

0    10
1    20
2    30
3    40
Name: RoLLNO, dtype: int64

In [ ]:
import pandas as pd
a=pd.Series(["LOKI","MOHAN","GANI","VAMSI"],name="Students")
print(a)

0     LOKI
1    MOHAN
2     GANI
3    VAMSI
Name: Students, dtype: object

In [ ]:
#CREATING SERIES OBJECT BY USING RANGE AND LIST
import pandas as pd
a=range(100)
b=list(a)
c=pd.Series(a)
print(c)

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

In [ ]:
#3.CREATING A SERIES FROM A ARRAY
import pandas as pd
import numpy as np
a=[10,20,30,40,50]
b=np.array(a)
print(b)
print(type(b))

[10 20 30 40 50]
<class 'numpy.ndarray'>

In [ ]:
#FINDING DATATYPE OF AN ARRAY
import pandas as pd
import numpy as np
a=(10,20,30,40,50)
b=np.array(a)
r=list(a)
print(b)
print(type(a))

[10 20 30 40 50]
<class 'tuple'>

In [ ]:
#creating ndarray and passing argument to the Series
import pandas as pd
import numpy as np
a=[10,20,30,40,50]
b=np.array(a)
c=pd.Series(b)
print(c)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
#Creating Series using ndarray
##Ex1:
import pandas as pd
import numpy as np
values=['a','b','c','d']
data=np.array(values)
s=pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
##Ex2:
import pandas as pd
import numpy as np
values=["loki","mohan","dimple","murari"]
data=np.array(values)
s=pd.Series(data)
print(s)

0      loki
1     mohan
2    dimple
3    murari
dtype: object

In [ ]:
#----------------INDEX IN SERIES----------------------#
#Creating Series object and giving name and index
##Ex1:
import pandas as pd
a=[156,123,86,62,76]
i=[10,20,30,40,50]
b=pd.Series(a,name="Marks",index=i)
print(b)

10    156
20    123
30     86
40     62
50     76
Name: Marks, dtype: int64

In [ ]:
#Ex2:
import pandas as pd
Prices=[50000,75000,90000,120000]
Products=["Lenovo","Dell","Honor","MacBook"]
b=pd.Series(Prices,name="Laptops",index=Products)
print(b)

Lenovo      50000
Dell        75000
Honor       90000
MacBook    120000
Name: Laptops, dtype: int64

In [ ]:
##Ex3:
import pandas as pd
sales=pd.Series([2000,6000,4500,7100,3600],index=["jan","feb","mar","apr","may"])
print(sales)

jan    2000
feb    6000
mar    4500
apr    7100
may    3600
dtype: int64

In [ ]:
#-----Accessing values in Series------#
##Ex:1
import pandas as pd
a=[45,61,85,33,54]
b=pd.Series(a,name="Marks")
print(b)
print()
print(b[0])
print(b[1])

0    45
1    61
2    85
3    33
4    54
Name: Marks, dtype: int64

45
61

In [ ]:
##Ex:2
import pandas as pd
Prices=[50000,75000,90000,120000]
Products=["Lenovo","Dell","Honor","MacBook"]
b=pd.Series(Prices,name="Laptops",index=Products)
print(b)
print()
print(b["Lenovo"])
print(b["MacBook"])

Lenovo      50000
Dell        75000
Honor       90000
MacBook    120000
Name: Laptops, dtype: int64

50000
120000

In [ ]:
###---Finding values in Dictionary using Series----####
#Ex:1
import pandas as pd
emp_data={"idno":250,"name":"loki","salary":25000.00}
s=pd.Series(emp_data)
print(s.iloc[0])
print(s.iloc[1])
print(s.iloc[2])

250
loki
25000.0

In [ ]:
#Ex2:Key not Available Sometimes
import pandas as pd
emp_data={"idno":250,"name":"loki","salary":25000.00}
s=pd.Series(emp_data)
data=s.get(["deptno"],"Not a key")
print(data)

Not a key

In [ ]:
##---- Getting Top Rows using Series ------##
import pandas as pd
emp_data={"name":"lokesh","age":22,"job":"data scientist"}
s=pd.Series(emp_data)
print(s.head(2))

name    lokesh
age         22
dtype: object

In [ ]:
##------Getting The Bottom Rows Using Series-------##
import pandas as pd
student_data={"name":"lokesh","class":12,"RollNo":33,"Branch":"MPC"}
s=pd.Series(student_data)
print(s.tail(3))

class      12
RollNo     33
Branch    MPC
dtype: object

In [ ]:
##---------NaN Using in Series--------------##
import pandas as pd
sales=pd.Series([100,np.nan,300,400,500],index=["jan","feb","march","april","march"],name="data")
print(sales)
print(sales.hasnans)
print(sales.ndim)
print(sales.shape)

jan      100.0
feb        NaN
march    300.0
april    400.0
march    500.0
Name: data, dtype: float64
True
1
(5,)

In [ ]:
#Creating a DataFrame from a Dictionary
import pandas as pd
data={
     'Name':['loki','mohan','dimple','murari'],
     'Age':[23,22,20,21],
     'Marks':[96,89,87,91]
}
df=pd.DataFrame(data)
print(df)

     Name  Age  Marks
0    loki   23     96
1   mohan   22     89
2  dimple   20     87
3  murari   21     91

In [ ]:
#Creating a DataFrame from a List of Lists
import pandas as pd
data=[
    ['loki',23,96],
    ['mohan',22,89],
    ['dimple',20,87],
    ['murari',21,91]
]
df=pd.DataFrame(data,columns=["Name","Age","Marks"])
print(df)

     Name  Age  Marks
0    loki   23     96
1   mohan   22     89
2  dimple   20     87
3  murari   21     91